In [ ]:
print('hi')

https://google.com/

In [ ]:
[GOOGLE](https://google.com)

[GOOGLE](https://google.com)

In [ ]:
텍스트

텍스트

In [1]:
import pandas as pd
import numpy as np

In [ ]:
pd.__version__

In [ ]:
pd.__version__
pd.__version__

In [ ]:
a=1
b=2

In [ ]:
print(a)
print(b)

# 시리즈

- 같은종류의 데이터 집합, 컬럼단위

In [5]:
pd.Series([1,3,5,7,6,8],dtype="int32")

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int32

In [6]:
pd.Series([1,3,'5',7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: object

In [8]:
dates = pd.date_range("20130101",periods=6)

In [9]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [35]:
df = pd.DataFrame(np.random.randn(6,4),
             index=dates,
            columns=list("ABCD"))

In [11]:
list("ABCD")

['A', 'B', 'C', 'D']

In [12]:
pd.DataFrame(np.random.randn(6,4))

          0         1         2         3
0 -1.080758 -1.223307  0.231025 -0.069510
1 -1.585082 -2.971655 -2.187259  0.744901
2  0.495532  0.938071  1.115131 -1.085257
3  0.306150 -1.430154  0.127588 -0.483627
4  0.759263  0.714487 -0.103278 -2.154861
5 -0.008379  0.408514  0.247551 -0.653696

In [15]:
df2 = pd.DataFrame(
    {
        "A":0.1,
        "B":pd.Timestamp("20130102"),
        "C":pd.Series(1,index=list(range(4)),dtype="float32"),
        "D":np.array([3]*4,dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"foo"
    }
)

In [16]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [17]:
type(df2)

pandas.core.frame.DataFrame

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [19]:
df2.shape

(4, 6)

In [20]:
df2.ndim

2

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [23]:
df2.head(2)

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [25]:
df2.tail(2)

     A          B    C  D      E    F
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [27]:
df2.sample(2)

     A          B    C  D      E    F
2  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [28]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [29]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [30]:
df2.values

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [31]:
type(df2.index)

pandas.core.indexes.numeric.Int64Index

In [32]:
type(df2.columns)

pandas.core.indexes.base.Index

In [33]:
type(df2.values)

numpy.ndarray

In [34]:
df

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [37]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.478691  0.315190 -0.897716 -0.267697
std    1.561354  0.526624  0.708443  1.069697
min   -2.158232 -0.674627 -1.941989 -1.522291
25%    0.142647  0.288925 -1.203202 -1.007624
50%    0.447284  0.413142 -0.898384 -0.210902
75%    1.454306  0.590442 -0.596564  0.042647
max    2.304729  0.842423  0.153226  1.483949

In [38]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   0.1  1.0  3.0
std    0.0  0.0  0.0
min    0.1  1.0  3.0
25%    0.1  1.0  3.0
50%    0.1  1.0  3.0
75%    0.1  1.0  3.0
max    0.1  1.0  3.0

In [39]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.437152    0.044479    1.786603   -2.158232    0.457415    2.304729
B    0.447691    0.378594    0.259035   -0.674627    0.638025    0.842423
C   -0.872043   -0.924725   -1.941989    0.153226   -1.296027   -0.504738
D    0.043661   -0.461408    1.483949   -1.189696    0.039604   -1.522291

In [40]:
df.transpose()

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.437152    0.044479    1.786603   -2.158232    0.457415    2.304729
B    0.447691    0.378594    0.259035   -0.674627    0.638025    0.842423
C   -0.872043   -0.924725   -1.941989    0.153226   -1.296027   -0.504738
D    0.043661   -0.461408    1.483949   -1.189696    0.039604   -1.522291

In [43]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06  2.304729  0.842423 -0.504738 -1.522291
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-01  0.437152  0.447691 -0.872043  0.043661

In [46]:
df.shape

(6, 4)

In [44]:
df.sort_index(ascending=False,axis=1)

                   D         C         B         A
2013-01-01  0.043661 -0.872043  0.447691  0.437152
2013-01-02 -0.461408 -0.924725  0.378594  0.044479
2013-01-03  1.483949 -1.941989  0.259035  1.786603
2013-01-04 -1.189696  0.153226 -0.674627 -2.158232
2013-01-05  0.039604 -1.296027  0.638025  0.457415
2013-01-06 -1.522291 -0.504738  0.842423  2.304729

In [48]:
df.sort_values(by=["A","B"],ascending=False)

                   A         B         C         D
2013-01-06  2.304729  0.842423 -0.504738 -1.522291
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696

In [50]:
df["A"]

2013-01-01    0.437152
2013-01-02    0.044479
2013-01-03    1.786603
2013-01-04   -2.158232
2013-01-05    0.457415
2013-01-06    2.304729
Freq: D, Name: A, dtype: float64

In [51]:
df[0:3]

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949

In [52]:
df["A":"C"]

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [A] of type str

In [53]:
df['2013-01-02':'2013-01-04']

                   A         B         C         D
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696

df.loc[label] : 컬럼, 인덱스 이름 그대로
df.iloc[position] : 인덱스

In [54]:
df

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-06  2.304729  0.842423 -0.504738 -1.522291

In [60]:
df.loc['2013-01-03':'2013-01-04','B':'C']

                   B         C
2013-01-03  0.259035 -1.941989
2013-01-04 -0.674627  0.153226

In [56]:
df.loc[['2013-01-03','2013-01-04'],['B','C']]

                   B         C
2013-01-03  0.259035 -1.941989
2013-01-04 -0.674627  0.153226

In [57]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [61]:
df.iloc[1:3,2:4]

                   C         D
2013-01-02 -0.924725 -0.461408
2013-01-03 -1.941989  1.483949

In [62]:
#df[조건]

In [63]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-06  2.304729  0.842423 -0.504738 -1.522291

In [64]:
df['A']>0

2013-01-01     True
2013-01-02     True
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

In [65]:
df[df>0]

                   A         B         C         D
2013-01-01  0.437152  0.447691       NaN  0.043661
2013-01-02  0.044479  0.378594       NaN       NaN
2013-01-03  1.786603  0.259035       NaN  1.483949
2013-01-04       NaN       NaN  0.153226       NaN
2013-01-05  0.457415  0.638025       NaN  0.039604
2013-01-06  2.304729  0.842423       NaN       NaN

In [67]:
df2 = df.copy()

In [69]:
df2["E"]= ["one", "one", "two", "three", "four", "three"]

In [70]:
df2

                   A         B         C         D      E
2013-01-01  0.437152  0.447691 -0.872043  0.043661    one
2013-01-02  0.044479  0.378594 -0.924725 -0.461408    one
2013-01-03  1.786603  0.259035 -1.941989  1.483949    two
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696  three
2013-01-05  0.457415  0.638025 -1.296027  0.039604   four
2013-01-06  2.304729  0.842423 -0.504738 -1.522291  three

In [71]:
df

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-06  2.304729  0.842423 -0.504738 -1.522291

In [73]:
df3.values

array([ 0.43715221,  0.04447852,  1.78660345, -2.15823188,  0.45741493,
        2.30472884])

In [74]:
df3 = [ 1,  0,  1, -2.15823188,  -0.45741493,
        0.30472884]

In [75]:
df3

[1, 0, 1, -2.15823188, -0.45741493, 0.30472884]

In [78]:
df

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-06  2.304729  0.842423 -0.504738 -1.522291

In [79]:
df2[df2["E"].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.786603  0.259035 -1.941989  1.483949   two
2013-01-05  0.457415  0.638025 -1.296027  0.039604  four

In [82]:
df

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696
2013-01-05  0.457415  0.638025 -1.296027  0.039604
2013-01-06  2.304729  0.842423 -0.504738 -1.522291

In [83]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+["E"])

In [84]:
df1

                   A         B         C         D   E
2013-01-01  0.437152  0.447691 -0.872043  0.043661 NaN
2013-01-02  0.044479  0.378594 -0.924725 -0.461408 NaN
2013-01-03  1.786603  0.259035 -1.941989  1.483949 NaN
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696 NaN

In [89]:
df1.loc[dates[0]:dates[1],'E']=1

In [93]:
df4 = df1.copy()

In [102]:
df4.dropna(how='all',axis=1)

                   A         B         C         D    E
2013-01-01  0.437152  0.447691 -0.872043  0.043661  1.0
2013-01-02  0.044479  0.378594 -0.924725 -0.461408  1.0
2013-01-03  1.786603  0.259035 -1.941989  1.483949  NaN
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696  NaN

In [95]:
df4 = df1.copy()

In [103]:
df4.dropna(how='any',axis=1)

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696

In [97]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+["E"])
df1

                   A         B         C         D   E
2013-01-01  0.437152  0.447691 -0.872043  0.043661 NaN
2013-01-02  0.044479  0.378594 -0.924725 -0.461408 NaN
2013-01-03  1.786603  0.259035 -1.941989  1.483949 NaN
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696 NaN

In [99]:
df1.dropna(how='all',axis=1)

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.044479  0.378594 -0.924725 -0.461408
2013-01-03  1.786603  0.259035 -1.941989  1.483949
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696

In [104]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D    E
2013-01-01  0.437152  0.447691 -0.872043  0.043661  1.0
2013-01-02  0.044479  0.378594 -0.924725 -0.461408  1.0
2013-01-03  1.786603  0.259035 -1.941989  1.483949  NaN
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696  NaN

In [106]:
df1['E'].mean()

1.0

In [107]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01  0.437152  0.447691 -0.872043  0.043661  1.0
2013-01-02  0.044479  0.378594 -0.924725 -0.461408  1.0
2013-01-03  1.786603  0.259035 -1.941989  1.483949  1.0
2013-01-04 -2.158232 -0.674627  0.153226 -1.189696  1.0

In [111]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1.loc[dates[0],'A']=np.nan
df1.loc[dates[1],'B']=np.nan
df1.loc[dates[3],'C']=np.nan
df1.loc[dates[1],'D']=np.nan
df1

                   A         B         C         D    E
2013-01-01       NaN  0.447691 -0.872043  0.043661  1.0
2013-01-02  0.044479       NaN -0.924725       NaN  1.0
2013-01-03  1.786603  0.259035 -1.941989  1.483949  NaN
2013-01-04 -2.158232 -0.674627       NaN -1.189696  NaN

In [112]:
df1.mean()

A   -0.109050
B    0.010699
C   -1.246252
D    0.112638
E    1.000000
dtype: float64

In [113]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.109050  0.447691 -0.872043  0.043661  1.0
2013-01-02  0.044479  0.010699 -0.924725  0.112638  1.0
2013-01-03  1.786603  0.259035 -1.941989  1.483949  1.0
2013-01-04 -2.158232 -0.674627 -1.246252 -1.189696  1.0

In [114]:
df2[(df2['E']=='two')|(df2['E']=='four')]

                   A         B         C         D     E
2013-01-03  1.786603  0.259035 -1.941989  1.483949   two
2013-01-05  0.457415  0.638025 -1.296027  0.039604  four

In [115]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.786603  0.259035 -1.941989  1.483949   two
2013-01-05  0.457415  0.638025 -1.296027  0.039604  four

In [116]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [117]:
df1.isna()

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [123]:
df1.isna().sum()/df1.shape[0]*100

A    25.0
B    25.0
C    25.0
D    25.0
E    50.0
dtype: float64

In [119]:
df1.isna().sum().sum()

6

In [121]:
df1.count()

A    3
B    3
C    3
D    3
E    2
dtype: int64

In [124]:
df.mean()

A    0.478691
B    0.315190
C   -0.897716
D   -0.267697
dtype: float64

In [126]:
df.mean(1)

2013-01-01    0.014115
2013-01-02   -0.240765
2013-01-03    0.396900
2013-01-04   -0.967332
2013-01-05   -0.040246
2013-01-06    0.280031
Freq: D, dtype: float64

In [127]:
df.std()

A    1.561354
B    0.526624
C    0.708443
D    1.069697
dtype: float64

In [128]:
df.var()

A    2.437826
B    0.277333
C    0.501892
D    1.144251
dtype: float64

In [129]:
df.max()

A    2.304729
B    0.842423
C    0.153226
D    1.483949
dtype: float64

In [132]:
df.min()

A   -2.158232
B   -0.674627
C   -1.941989
D   -1.522291
dtype: float64

In [131]:
df.median()

A    0.447284
B    0.413142
C   -0.898384
D   -0.210902
dtype: float64

In [133]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.437152  0.447691 -0.872043  0.043661
2013-01-02  0.481631  0.826285 -1.796768 -0.417747
2013-01-03  2.268234  1.085319 -3.738757  1.066202
2013-01-04  0.110002  0.410692 -3.585530 -0.123495
2013-01-05  0.567417  1.048718 -4.881558 -0.083890
2013-01-06  2.872146  1.891141 -5.386296 -1.606181

In [134]:
def dataa(x):
    return x.max()-x.min()

df.apply(dataa)

A    4.462961
B    1.517050
C    2.095216
D    3.006240
dtype: float64

In [135]:
df.apply(lambda x: x.max()-x.min())

A    4.462961
B    1.517050
C    2.095216
D    3.006240
dtype: float64

In [136]:
gender=pd.Series(["남자","여자","여자","여자","남","male"])

In [137]:
gender.value_counts()

여자      3
남자      1
남       1
male    1
dtype: int64

In [143]:
gender.replace("남","남자",inplace=True)

In [141]:
gender.replace(["남","male"],["남자","남자"])

0    남자
1    여자
2    여자
3    여자
4    남자
5    남자
dtype: object

In [142]:
gender.str.replace("남","남자")

0      남자
1      여자
2      여자
3      여자
4       남
5    male
dtype: object

In [144]:
gender

0      남자
1      여자
2      여자
3      여자
4      남자
5    male
dtype: object

In [145]:
df = pd.DataFrame(np.random.randn(10,4))

In [146]:
df

          0         1         2         3
0 -2.799382  0.136126  1.141942 -0.957552
1 -1.840115 -1.362588 -0.128221  0.481076
2 -1.539265 -0.581095 -0.856713 -0.572502
3 -0.188999 -0.774015 -1.164495  0.753361
4  0.789639  0.064764  1.738954 -0.525096
5 -0.980342 -1.356277 -1.101346  0.042541
6 -0.188080 -0.435986 -0.182051  0.869647
7 -0.030653  0.186347  1.208768 -0.465966
8  0.024890 -0.034379  0.420891  0.606229
9 -0.844170  0.176756  0.149893  0.223378

In [147]:
pieces = [df[:3],df[3:7],df[7:]]

In [149]:
pieces[0]

          0         1         2         3
0 -2.799382  0.136126  1.141942 -0.957552
1 -1.840115 -1.362588 -0.128221  0.481076
2 -1.539265 -0.581095 -0.856713 -0.572502

In [150]:
pieces[1]

          0         1         2         3
3 -0.188999 -0.774015 -1.164495  0.753361
4  0.789639  0.064764  1.738954 -0.525096
5 -0.980342 -1.356277 -1.101346  0.042541
6 -0.188080 -0.435986 -0.182051  0.869647

In [151]:
pieces[2]

          0         1         2         3
7 -0.030653  0.186347  1.208768 -0.465966
8  0.024890 -0.034379  0.420891  0.606229
9 -0.844170  0.176756  0.149893  0.223378

In [154]:
pd.concat([pieces[0],pieces[1],pieces[2]],axis=1)

,0,1,2,3,0,1,2,3,0,1,2,3
0,-2.799382,0.136126,1.141942,-0.957552,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,-1.840115,-1.362588,-0.128221,0.481076,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,-1.539265,-0.581095,-0.856713,-0.572502,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-0.188999,-0.774015,-1.164495,0.753361,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,0.789639,0.064764,1.738954,-0.525096,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,-0.980342,-1.356277,-1.101346,0.042541,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,-0.188080,-0.435986,-0.182051,0.869647,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.030653,0.186347,1.208768,-0.465966
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.024890,-0.034379,0.420891,0.606229
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.844170,0.176756,0.149893,0.223378

In [155]:
pd.concat([pieces[0],pieces[1],pieces[2]],axis=1,join= 'inner')

Empty DataFrame
Columns: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]
Index: []

In [156]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [157]:
left

   key  lval
0  foo     1
1  foo     2

In [158]:
right

   key  rval
0  foo     4
1  foo     5

In [159]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [160]:
pd.merge(left, right, left_on="key", right_on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [162]:
left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [163]:
left.join(right)

     lval  rval
key
foo     1     4
foo     1     5
foo     2     4
foo     2     5

In [165]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [166]:
df

     A      B         C         D
0  foo    one  0.519882  1.218934
1  bar    one -0.055830  0.383434
2  foo    two -0.334295  0.113704
3  bar  three  0.362790 -0.126122
4  foo    two  0.295077 -1.326855
5  bar    two -1.315966  0.397241
6  foo    one -1.954941 -1.600407
7  foo  three -0.278973  0.484659

In [167]:
df.sum()

A        foobarfoobarfoobarfoofoo
B    oneonetwothreetwotwoonethree
C                       -2.762257
D                       -0.455412
dtype: object

In [171]:
test = df.groupby(["A","B"]).sum()

In [173]:
test.stack()

A    B
bar  one    C   -0.055830
            D    0.383434
     three  C    0.362790
            D   -0.126122
     two    C   -1.315966
            D    0.397241
foo  one    C   -1.435060
            D   -0.381474
     three  C   -0.278973
            D    0.484659
     two    C   -0.039218
            D   -1.213151
dtype: float64

In [177]:
test1=test.stack()
test1.unstack(0)

A             bar       foo
B
one   C -0.055830 -1.435060
      D  0.383434 -0.381474
three C  0.362790 -0.278973
      D -0.126122  0.484659
two   C -1.315966 -0.039218
      D  0.397241 -1.213151

In [178]:
test1.unstack(1)

B           one     three       two
A
bar C -0.055830  0.362790 -1.315966
    D  0.383434 -0.126122  0.397241
foo C -1.435060 -0.278973 -0.039218
    D -0.381474  0.484659 -1.213151

In [180]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [181]:
df

        A  B    C         D         E
0     one  A  foo  0.571674 -0.651042
1     one  B  foo -1.076854 -1.408009
2     two  C  foo -1.107885 -0.244913
3   three  A  bar  1.429630 -0.201256
4     one  B  bar  3.744730  1.101856
5     one  C  bar -0.733142  1.445717
6     two  A  foo  1.247155  0.369713
7   three  B  foo  1.549876 -0.550246
8     one  C  foo  1.496893 -0.058902
9     one  A  bar -0.722682  0.437018
10    two  B  bar  0.559919 -0.059273
11  three  C  bar  0.064056 -1.215903

In [185]:
test = pd.pivot_table(df,values="D",index=["A","B"],columns=["C"],aggfunc="sum")

In [190]:
test.reset_index(inplace=True)

In [193]:
test.melt(id_vars=['A','B'])

        A  B    C     value
0     one  A  bar -0.722682
1     one  B  bar  3.744730
2     one  C  bar -0.733142
3   three  A  bar  1.429630
4   three  B  bar       NaN
5   three  C  bar  0.064056
6     two  A  bar       NaN
7     two  B  bar  0.559919
8     two  C  bar       NaN
9     one  A  foo  0.571674
10    one  B  foo -1.076854
11    one  C  foo  1.496893
12  three  A  foo       NaN
13  three  B  foo  1.549876
14  three  C  foo       NaN
15    two  A  foo  1.247155
16    two  B  foo       NaN
17    two  C  foo -1.107885

In [192]:
test.head(2)

C    A  B       bar       foo
0  one  A -0.722682  0.571674
1  one  B  3.744730 -1.076854

In [191]:
test

C      A  B       bar       foo
0    one  A -0.722682  0.571674
1    one  B  3.744730 -1.076854
2    one  C -0.733142  1.496893
3  three  A  1.429630       NaN
4  three  B       NaN  1.549876
5  three  C  0.064056       NaN
6    two  A       NaN  1.247155
7    two  B  0.559919       NaN
8    two  C       NaN -1.107885

In [197]:
data = pd.read_csv('전라북도_소방서별 소방자동차 현황_20170810..csv',encoding='cp949')
data.head(2)

,시군,고가차 53(m),고가차 52(m),고가차 46(m),굴 절차 36(m),굴 절차 28(m),굴 절차 27(m),배 연 차,구 급 차,구조차 버스,...,굴 삭 기,"트레일러 공기,양수",트레일러 보트,이동정비차,이동체험차,장비운반차,이동중계차,산불진화차,유 조 차,버 스
0,본부,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,1,1.0,NaN,1.0,2.0
1,덕진,1.0,NaN,NaN,NaN,NaN,1.0,NaN,10.0,1.0,...,NaN,1.0,1.0,NaN,NaN,1,NaN,1.0,NaN,NaN

In [198]:
data.melt(id_vars="시군")

      시군   variable  value
0     본부  고가차 53(m)    NaN
1     덕진  고가차 53(m)    1.0
2     완산  고가차 53(m)    NaN
3     군산  고가차 53(m)    NaN
4     익산  고가차 53(m)    1.0
..   ...        ...    ...
369   남원      버   스    NaN
370   김제      버   스    NaN
371   고창      버   스    NaN
372   부안      버   스    NaN
373  무진장      버   스    NaN

[374 rows x 3 columns]